released/M031BSP_FMC_IAP_IN_SRAM_LDROM/SampleCode/LDROM/main.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

// #include "misc_config.h"

#include "update_flash.h"
/*_____ D E C L A R A T I O N S ____________________________________________*/

// struct flag_32bit flag_PROJ_CTL;
// #define FLAG_PROJ_REVERSE0                       	    (flag_PROJ_CTL.bit0)
// #define FLAG_PROJ_REVERSE1                   			(flag_PROJ_CTL.bit1)
// #define FLAG_PROJ_REVERSE2                 				(flag_PROJ_CTL.bit2)
// #define FLAG_PROJ_REVERSE3                              (flag_PROJ_CTL.bit3)
// #define FLAG_PROJ_REVERSE4                              (flag_PROJ_CTL.bit4)
// #define FLAG_PROJ_REVERSE5                              (flag_PROJ_CTL.bit5)
// #define FLAG_PROJ_REVERSE6                              (flag_PROJ_CTL.bit6)
// #define FLAG_PROJ_REVERSE7                              (flag_PROJ_CTL.bit7)


/*_____ D E F I N I T I O N S ______________________________________________*/

// volatile unsigned int counter_systick = 0;
// volatile uint32_t counter_tick = 0;


/*_____ M A C R O S ________________________________________________________*/

/*_____ F U N C T I O N S __________________________________________________*/

// unsigned int get_systick(void)
// {
// 	return (counter_systick);
// }

// void set_systick(unsigned int t)
// {
// 	counter_systick = t;
// }

// void systick_counter(void)
// {
// 	counter_systick++;
// }

// void SysTick_Handler(void)
// {

//     systick_counter();

//     if (get_systick() >= 0xFFFFFFFF)
//     {
//         set_systick(0);      
//     }

//     // if ((get_systick() % 1000) == 0)
//     // {
       
//     // }

//     #if defined (ENABLE_TICK_EVENT)
//     TickCheckTickEvent();
//     #endif    
// }

// void SysTick_delay(unsigned int delay)
// {  
    
//     unsigned int tickstart = get_systick(); 
//     unsigned int wait = delay; 

//     while((get_systick() - tickstart) < wait) 
//     { 
//     } 

// }

// void SysTick_enable(unsigned int ticks_per_second)
// {
//     set_systick(0);
//     if (SysTick_Config(SystemCoreClock / ticks_per_second))
//     {
//         /* Setup SysTick Timer for 1 second interrupts  */
//         printf("Set system tick error!!\n");
//         while (1);
//     }

//     #if defined (ENABLE_TICK_EVENT)
//     TickInitTickEvent();
//     #endif
// }

// uint32_t get_tick(void)
// {
// 	return (counter_tick);
// }

// void set_tick(uint32_t t)
// {
// 	counter_tick = t;
// }

// void tick_counter(void)
// {
// 	counter_tick++;
//     if (get_tick() >= 60000)
//     {
//         set_tick(0);
//     }
// }

// void delay_ms(uint16_t ms)
// {
// 	#if 1
//     uint32_t tickstart = get_tick();
//     uint32_t wait = ms;
// 	uint32_t tmp = 0;
	
//     while (1)
//     {
// 		if (get_tick() > tickstart)	// tickstart = 59000 , tick_counter = 60000
// 		{
// 			tmp = get_tick() - tickstart;
// 		}
// 		else // tickstart = 59000 , tick_counter = 2048
// 		{
// 			tmp = 60000 -  tickstart + get_tick();
// 		}		
		
// 		if (tmp > wait)
// 			break;
//     }
	
// 	#else
// 	TIMER_Delay(TIMER0, 1000*ms);
// 	#endif
// }


//
// check_reset_source
//
// uint8_t check_reset_source(void)
// {
//     uint32_t src = SYS_GetResetSrc();

//     SYS->RSTSTS |= 0x1FF;
//     printf("Reset Source <0x%08X>\r\n", src);

//     #if 1   //DEBUG , list reset source
//     if (src & BIT0)
//     {
//         printf("0)POR Reset Flag\r\n");       
//     }
//     if (src & BIT1)
//     {
//         printf("1)NRESET Pin Reset Flag\r\n");       
//     }
//     if (src & BIT2)
//     {
//         printf("2)WDT Reset Flag\r\n");       
//     }
//     if (src & BIT3)
//     {
//         printf("3)LVR Reset Flag\r\n");       
//     }
//     if (src & BIT4)
//     {
//         printf("4)BOD Reset Flag\r\n");       
//     }
//     if (src & BIT5)
//     {
//         printf("5)System Reset Flag \r\n");       
//     }
//     if (src & BIT6)
//     {
//         printf("6)Reserved.\r\n");       
//     }
//     if (src & BIT7)
//     {
//         printf("7)CPU Reset Flag\r\n");       
//     }
//     if (src & BIT8)
//     {
//         printf("8)CPU Lockup Reset Flag\r\n");       
//     }
//     #endif
    
//     if (src & SYS_RSTSTS_PORF_Msk) {
//         SYS_ClearResetSrc(SYS_RSTSTS_PORF_Msk);
        
//         printf("power on from POR\r\n");
//         return FALSE;
//     }    
//     else if (src & SYS_RSTSTS_PINRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_PINRF_Msk);
        
//         printf("power on from nRESET pin\r\n");
//         return FALSE;
//     } 
//     else if (src & SYS_RSTSTS_WDTRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_WDTRF_Msk);
        
//         printf("power on from WDT Reset\r\n");
//         return FALSE;
//     }    
//     else if (src & SYS_RSTSTS_LVRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_LVRF_Msk);
        
//         printf("power on from LVR Reset\r\n");
//         return FALSE;
//     }    
//     else if (src & SYS_RSTSTS_BODRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_BODRF_Msk);
        
//         printf("power on from BOD Reset\r\n");
//         return FALSE;
//     }    
//     else if (src & SYS_RSTSTS_SYSRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_SYSRF_Msk);
        
//         printf("power on from System Reset\r\n");
//         return FALSE;
//     } 
//     else if (src & SYS_RSTSTS_CPURF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_CPURF_Msk);

//         printf("power on from CPU reset\r\n");
//         return FALSE;         
//     }    
//     else if (src & SYS_RSTSTS_CPULKRF_Msk)
//     {
//         SYS_ClearResetSrc(SYS_RSTSTS_CPULKRF_Msk);
        
//         printf("power on from CPU Lockup Reset\r\n");
//         return FALSE;
//     }   
    
//     printf("power on from unhandle reset source\r\n");
//     return FALSE;
// }

// void TMR1_IRQHandler(void)
// {
	
//     if(TIMER_GetIntFlag(TIMER1) == 1)
//     {
//         TIMER_ClearIntFlag(TIMER1);
// 		tick_counter();

// 		if ((get_tick() % 1000) == 0)
// 		{
//             FLAG_PROJ_TIMER_PERIOD_1000MS = 1;//set_flag(flag_timer_period_1000ms ,ENABLE);
// 		}

// 		if ((get_tick() % 50) == 0)
// 		{

// 		}	
//     }
// }

// void TIMER1_Init(void)
// {
//     TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 1000);
//     TIMER_EnableInt(TIMER1);
//     NVIC_EnableIRQ(TMR1_IRQn);	
//     TIMER_Start(TIMER1);
// }

// void loop(void)
// {
// 	static uint32_t LOG1 = 0;
// 	// static uint32_t LOG2 = 0;

//     if ((get_systick() % 1000) == 0)
//     {
//         // printf("%s(systick) : %4d\r\n",__FUNCTION__,LOG2++);    
//     }

//     if (FLAG_PROJ_TIMER_PERIOD_1000MS)//(is_flag_set(flag_timer_period_1000ms))
//     {
//         FLAG_PROJ_TIMER_PERIOD_1000MS = 0;//set_flag(flag_timer_period_1000ms ,DISABLE);

//         // printf("%s(timer) : %4d\r\n",__FUNCTION__,LOG1++);

//         #if defined (APP1)
//         printf("APP1:%s(timer) : %4d\r\n",__FUNCTION__,LOG1++);
//         #elif defined (APP2)
//         printf("APP2:%s(timer) : %4d\r\n",__FUNCTION__,LOG1++);
//         #endif

//         PB14 ^= 1;        
//     }
// }

// #pragma arm section code="fastcode" 
// void UARTx_Process(void)
// {
// 	uint8_t res = 0;
// 	res = UART_READ(UART0);

// 	if (res > 0x7F)
// 	{
// 		printf("invalid command\r\n");
// 	}
// 	else
// 	{
// 		printf("press : %c\r\n" , res);
// 		switch(res)
// 		{
// 			case '1':

// 				break;

// 			case 'X':
// 			case 'x':
// 			case 'Z':
// 			case 'z':
//                 SYS_UnlockReg();
// 				// NVIC_SystemReset();	// Reset I/O and peripherals , only check BS(FMC_ISPCTL[1])
//                 // SYS_ResetCPU();     // Not reset I/O and peripherals
//                 SYS_ResetChip();    // Reset I/O and peripherals ,  BS(FMC_ISPCTL[1]) reload from CONFIG setting (CBS)	
// 				break;
// 		}
// 	}
// }

// void UART02_IRQHandler(void)
// {
//     if(UART_GET_INT_FLAG(UART0, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk))     /* UART receive data available flag */
//     {
//         while(UART_GET_RX_EMPTY(UART0) == 0)
//         {
// 			UARTx_Process();
//         }
//     }

//     if(UART0->FIFOSTS & (UART_FIFOSTS_BIF_Msk | UART_FIFOSTS_FEF_Msk | UART_FIFOSTS_PEF_Msk | UART_FIFOSTS_RXOVIF_Msk))
//     {
//         UART_ClearIntFlag(UART0, (UART_INTSTS_RLSINT_Msk| UART_INTSTS_BUFERRINT_Msk));
//     }	
// }

void UART0_Init(void)
{
    // SYS_ResetModule(UART0_RST);

    /* Configure UART0 and set UART0 baud rate */
    #if 1
    UART0->FUNCSEL = ((UART0->FUNCSEL & (~UART_FUNCSEL_FUNCSEL_Msk)) | UART_FUNCSEL_UART);
    /* Set UART line configuration */
    UART0->LINE = UART_WORD_LEN_8 | UART_PARITY_NONE | UART_STOP_BIT_1;
    /* Set UART Rx and RTS trigger level */
    UART0->FIFO = UART_FIFO_RFITL_14BYTES | UART_FIFO_RTSTRGLV_14BYTES;
    /* Set UART baud rate */
    UART0->BAUD = (UART_BAUD_MODE2 | UART_BAUD_MODE2_DIVIDER(__HIRC, 115200));
    #else
    UART_Open(UART0, 115200);
    // UART_EnableInt(UART0, UART_INTEN_RDAIEN_Msk | UART_INTEN_RXTOIEN_Msk);
    // NVIC_EnableIRQ(UART02_IRQn);
    #endif
	
	#if (_debug_log_UART_ == 1)	//debug
	dbg_printf("\r\nCLK_GetCPUFreq : %8d\r\n",CLK_GetCPUFreq());
	dbg_printf("CLK_GetHCLKFreq : %8d\r\n",CLK_GetHCLKFreq());
	dbg_printf("CLK_GetHXTFreq : %8d\r\n",CLK_GetHXTFreq());
	dbg_printf("CLK_GetLXTFreq : %8d\r\n",CLK_GetLXTFreq());	
	dbg_printf("CLK_GetPCLK0Freq : %8d\r\n",CLK_GetPCLK0Freq());
	dbg_printf("CLK_GetPCLK1Freq : %8d\r\n",CLK_GetPCLK1Freq());	
	#endif	

    #if 0
    dbg_printf("FLAG_PROJ_TIMER_PERIOD_1000MS : 0x%2X\r\n",FLAG_PROJ_TIMER_PERIOD_1000MS);
    dbg_printf("FLAG_PROJ_REVERSE1 : 0x%2X\r\n",FLAG_PROJ_REVERSE1);
    dbg_printf("FLAG_PROJ_REVERSE2 : 0x%2X\r\n",FLAG_PROJ_REVERSE2);
    dbg_printf("FLAG_PROJ_REVERSE3 : 0x%2X\r\n",FLAG_PROJ_REVERSE3);
    dbg_printf("FLAG_PROJ_REVERSE4 : 0x%2X\r\n",FLAG_PROJ_REVERSE4);
    dbg_printf("FLAG_PROJ_REVERSE5 : 0x%2X\r\n",FLAG_PROJ_REVERSE5);
    dbg_printf("FLAG_PROJ_REVERSE6 : 0x%2X\r\n",FLAG_PROJ_REVERSE6);
    dbg_printf("FLAG_PROJ_REVERSE7 : 0x%2X\r\n",FLAG_PROJ_REVERSE7);
    #endif

}

// #pragma arm section 

// void GPIO_Init (void)
// {
//     SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB14MFP_Msk)) | (SYS_GPB_MFPH_PB14MFP_GPIO);
//     SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB15MFP_Msk)) | (SYS_GPB_MFPH_PB15MFP_GPIO);

//     GPIO_SetMode(PB, BIT14, GPIO_MODE_OUTPUT);
//     GPIO_SetMode(PB, BIT15, GPIO_MODE_OUTPUT);	

// }

void SYS_Init(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Set XT1_OUT(PF.2) and XT1_IN(PF.3) to input mode */
//    PF->MODE &= ~(GPIO_MODE_MODE2_Msk | GPIO_MODE_MODE3_Msk);
    
    // CLK_EnableXtalRC(CLK_PWRCTL_HIRCEN_Msk);
    // CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    /* Enable HIRC clock (Internal RC 48MHz) */
    CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;

    /* Wait for HIRC clock ready */
    while (!(CLK->STATUS & CLK_STATUS_HIRCSTB_Msk));

//    CLK_EnableXtalRC(CLK_PWRCTL_HXTEN_Msk);
//    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

//    CLK_EnableXtalRC(CLK_PWRCTL_LIRCEN_Msk);
//    CLK_WaitClockReady(CLK_STATUS_LIRCSTB_Msk);	

//    CLK_EnableXtalRC(CLK_PWRCTL_LXTEN_Msk);
//    CLK_WaitClockReady(CLK_STATUS_LXTSTB_Msk);	

    /* Select HCLK clock source as HIRC and HCLK source divider as 1 */
    // CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HIRC, CLK_CLKDIV0_HCLK(1));
 
    /* Select HCLK clock source as HIRC and HCLK clock divider as 1 */
    CLK->CLKSEL0 = (CLK->CLKSEL0 & (~CLK_CLKSEL0_HCLKSEL_Msk)) | CLK_CLKSEL0_HCLKSEL_HIRC;
    CLK->CLKDIV0 = (CLK->CLKDIV0 & (~CLK_CLKDIV0_HCLKDIV_Msk)) | CLK_CLKDIV0_HCLK(1);
    /* Set PLL to Power-down mode */
    CLK->PLLCTL |= CLK_PLLCTL_PD_Msk;

    // CLK_EnableModuleClock(ISP_MODULE);	  
    CLK->AHBCLK |= CLK_AHBCLK_ISPCKEN_Msk;

	// CLK_EnableModuleClock(CRC_MODULE);
    CLK->AHBCLK |= CLK_AHBCLK_CRCCKEN_Msk ;

    // CLK_EnableModuleClock(UART0_MODULE);
    // CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));

    /* Enable UART module clock */
    CLK->APBCLK0 |= CLK_APBCLK0_UART0CKEN_Msk;
    /* Select UART module clock source as HXT and UART module clock divider as 1 */
    CLK->CLKSEL1 = (CLK->CLKSEL1 & (~CLK_CLKSEL1_UART0SEL_Msk)) | CLK_CLKSEL1_UART0SEL_HIRC;
    CLK->CLKDIV0 = (CLK->CLKDIV0 & (~CLK_CLKDIV0_UART0DIV_Msk)) | CLK_CLKDIV0_UART0(1);

    // CLK_EnableModuleClock(TMR0_MODULE);
  	// CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0SEL_HIRC, 0);

    // CLK_EnableModuleClock(TMR1_MODULE);
  	// CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1SEL_HIRC, 0);

    /* Set PB multi-function pins for UART0 RXD=PB.12 and TXD=PB.13 */
    SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB12MFP_Msk | SYS_GPB_MFPH_PB13MFP_Msk)) |
                    (SYS_GPB_MFPH_PB12MFP_UART0_RXD | SYS_GPB_MFPH_PB13MFP_UART0_TXD);

   /* Update System Core Clock */
    SystemCoreClockUpdate();

    /* Lock protected registers */
    SYS_LockReg();
}

/*
 * This is a template project for M031 series MCU. Users could based on this project to create their
 * own application without worry about the IAR/Keil project settings.
 *
 * This template application uses external crystal as HCLK source and configures UART0 to print out
 * "Hello World", users may need to do extra system configuration based on their system design.
 */

int main()
{
    SYS_Init();

	// GPIO_Init();
	UART0_Init();
    get_checksum();
    update_ap_check();

	// TIMER1_Init();
    // check_reset_source();

    // SysTick_enable(1000);
    // #if defined (ENABLE_TICK_EVENT)
    // TickSetTickEvent(1000, TickCallback_processA);  // 1000 ms
    // TickSetTickEvent(5000, TickCallback_processB);  // 5000 ms
    // #endif



    /* Got no where to go, just loop forever */
    while(1)
    {
        // loop();

    }
}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
